Revit 2026 API

# EnergyDataSettingsExportComplexity Property

---

Value determines Export Complexity for GreenBuildingXML detailed model export.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public gbXMLExportComplexity ExportComplexity { get; set; }
```
```vb
Public Property ExportComplexity As gbXMLExportComplexity
	Get
	Set
```
```cpp
public:
property gbXMLExportComplexity ExportComplexity {
	gbXMLExportComplexity get ();
	void set (gbXMLExportComplexity value);
}
```
```fsharp
member ExportComplexity : gbXMLExportComplexity with get, set
```

#### Property Value

gbXMLExportComplexity

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The export complexity does not fall within an appropriate range. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace